<template>
  <div class="agreementMod">
    <div class="modal">
      <div class="textContent">
        <p class="special">用户协议</p>
        <p>掌金超注册协议</p>
        <p style="text-align:right">版本生效日期：2018年3月31日</p>
        <p>北京傲龙科技有限公司（以下简称“掌金超平台”）通过其运营的掌金超平台（微信公众号：掌金超）依据本协议的规定为您（以下简称“用户”）提供服务。本协议在用户和掌金超平台间具有法律效力。</p>
        <p>
          【审慎阅读】您在申请注册流程中点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、授权条款、法律适用和争议解决条款。免除或者限制责任的条款、授权条款将以粗体标识，您应重点阅读。如您对本协议有任何疑问，可向掌金超平台的客服咨询。</p>
        <p>
          【签约动作】当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，即表示您已充分阅读、理解并接受本协议的全部内容，并与掌金超平台达成一致，成为掌金超平台的注册用户。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。</p>
        <p>
          【协议修改】在本协议履行过程中，掌金超平台可根据实际情况对协议的相关条款进行修改。掌金超平台将通过掌金超公众号公布最新的协议，已签约的用户无需再次签约。如用户不同意掌金超平台对本协议所做的修改，应停止使用掌金超平台通过掌金超公众号提供的服务；如用户继续使用服务或未主动终止服务，则视为同意履行修改后的协议，并应依照修改后的协议履行应尽义务。</p>
        <p class="title">第一章 掌金超平台使用限制说明</p>
        <p class="item">第1条：</p>
        <p class="details">在使用掌金超平台通过掌金超公众号提供的服务前，您必须先在掌金超公众号完成注册，成为掌金超平台的注册用户。</p>
        <p class="item">第2条：</p>
        <p class="details">用户必须为符合中华人民共和国法律规定的具有完全民事权利和民事行为能力，能够独立承担民事责任的自然人、法人或其他组织。若用户违反前述限制注册使用掌金超平台提供的服务的，其监护人应承担所有责任。</p>
        <p class="item">第3条：</p>
        <p class="details">
          用户有义务确保其信息的真实性、准确性、完整性和有效性，并承诺对其提供的信息及时进行更新。若掌金超平台经判断有合理理由认定用户信息存在错误、虚假、过时情形的，掌金超平台有权终止用户在掌金超平台的账户；由此给用户造成损失的，掌金超平台不承担任何责任。</p>
        <p class="item">第4条：</p>
        <p class="details">
          用户有义务提供有效的联系方式，包括但不限于手机号码、电话号码、通讯地址、常用电子邮箱、联系人信息等。联系方式发生变更时，应在3日内联系掌金超客服说明情况。因用户未提供有效联系方式，导致掌金超平台未能提供相应服务或给用户造成损失的，由用户自行承担全部损失和不利法律后果。</p>
        <p class="title">第二章 掌金超平台服务内容说明</p>
        <p class="item">第5条：</p>
        <p class="details">
          掌金超平台通过掌金超平台为用户提供的服务包括但不限于：信息搜集、信息公布、甄别筛选、资信评估、信息交互、借贷撮合、融资咨询等相关服务。部分服务需要用户完成身份认证才能享用。用户因未完成身份认证而无法享受服务的，掌金超平台不承担任何责任。</p>
        <p class="item">第6条：</p>
        <p class="details">用户同意，其在掌金超平台上按流程所确认的状态，将成为进行相关操作的唯一依据。因用户未能及时对状态进行修改、确认而造成的损失由用户自行负责，掌金超平台不承担任何责任。</p>
        <p class="item">第7条：</p>
        <p class="details">用户遵循借贷自愿、推广自愿、诚实守信、责任自负、风险自担的原则承担借贷风险；掌金超平台仅为信息撮合平台，不提供增信服务，不承担借贷违约风险，也不提供直接批款服务，不做任何的批款承诺。</p>
        <p class="item">第8条：</p>
        <p class="details">
          掌金超平台采取适当的方法和技术，记录并妥善保存网络借贷业务活动数据和资料。用户绑定的手机号为掌金超平台向用户发送短信/公众号推送消息的接收手机/微信号。用户承诺，注册成功后会密切关注注册手机号/微信号。任何信息从掌金超平台发出起，即视为已告知用户，并且用户已知悉。</p>
        <p class="item">第9条：</p>
        <p class="details">掌金超平台属于信息撮合平台，无法提供贷款金额的“即时”金额转账服务，用户因借款资金到账延迟及由此产生的损失，掌金超平台不承担责任。</p>
        <p class="item">第10条：</p>
        <p class="details">掌金超平台将在法律允许的前提下尽到商业勤勉，保障其提供服务的质量以期用户可以通过掌金超平台顺利进行及完成贷款申请。</p>
        <p class="item">第11条：</p>
        <p class="details">
          为了改善用户体验，掌金超平台会根据需要对掌金超平台的产品及服务的各功能使用情况进行统计，这些统计一般为应用使用时间、页面停留时间、访问次数，访问路径等，并且会对应用报错数据进行收集。通过分析统计数据可以帮助我们提高产品质量及服务质量。</p>
        <p class="title">第三章 用户信息收集、使用和提供</p>
        <p class="item">第12条：</p>
        <p class="details">
          为促进网络借贷活动的合法顺利开展、便于掌金超平台对用户进行必要审核和提供相关服务，用户需要向掌金超平台提供包括但不限于姓名、身份证号码、手机号码、年龄、性别、职业、出生日期、户籍、通讯地址、教育情况、收入情况、婚姻家庭情况、通话情况、工作信息、收入信息、信用信息、信用卡信息、社保缴纳信息、公积金缴纳信息、银行流水信息、电商信息、保单信息等信息，且用户同意掌金超平台对前述信息进行处理分析。</p>
        <p class="item">第13条：</p>
        <p class="details">用户授权和同意掌金超平台将其身份证信息、手机号码等提供给相应的机构进行校验，以核实其身份和信息的真实性。</p>
        <p class="item">第14条：</p>
        <p class="details">用户授权和同意掌金超平台将其相应的用户信息、校验及处理分析结果提供给对应的合作机构，以减少客户重复提供信息的次数及利于合作机构判断用户是否满足其条件要求。</p>
        <p class="item">第15条：</p>
        <p class="details">为便于掌金超平台向用户提供后续服务、馈赠礼品，用户授权和同意掌金超平台将其联系方式信息提供给相应的合作商家。</p>
        <p class="item">第16条：</p>
        <p class="details">
          掌金超平台可能会与第三方合作向用户提供相应的服务，在此情况下，如该第三方同意承担与本平台同等的保护用户信息的责任，则用户同意掌金超平台将用户的相应信息提供给该第三方，并同意该第三方与其进行联系；用户同意掌金超平台及第三方向其引介掌金超平台及其他主体的产品及服务。</p>
        <p class="item">第17条：</p>
        <p class="details">掌金超平台可能会和商业合作伙伴处获得用户信息以补充掌金超平台自行收集的信息，以便于向用户提供服务，用户对此表示理解和同意。</p>
        <p class="item">第18条：</p>
        <p class="details">为了更好地向用户提供服务，防范交易风险或确定违约责任，用户授权掌金超平台向依法设立的征信机构查询用户的相关信用信息，包括但不限于任何信用分、信用报告、能够联系到用户的实体地址、电子邮件地址、电话号码。</p>
        <p class="item">第19条：</p>
        <p class="details">为了向用户提供或推荐产品或服务，或为了向用户提供更完善的服务，掌金超平台将会与合作伙伴共享用户的相关信息，用户对此表述理解和同意。</p>
        <p class="item">第20条：</p>
        <p class="details">为维护用户的合法权益或处理用户与他人的交易纠纷或争议，用户同意掌金超平台将相关信息向相关机构或相对方进行共享。</p>
        <p class="item">第21条：</p>
        <p class="details">
          根据法律规定及合理商业习惯，在掌金超平台计划与其他公司合并或被其收购或进行其他资本市场活动（包括但不限于IPO，债券发行）时，以及其他情形下，掌金超平台需要接受来自其他主体的尽职调查时，用户同意掌金超平台把用户的信息提供给必要的主体，但我们会通过和这些主体签署保密协议等方式要求其对用户信息采取合理的保密措施。</p>
        <p class="item">第22条：</p>
        <p class="details">如用户授权第三方向掌金超平台查询、采集用户在掌金超平台的账户相关信息，掌金超平台有权在法律法规和用户的授权许可范围内向第三方分享用户账户的部分信息。</p>
        <p class="item">第23条：</p>
        <p class="details">在经过处理无法识别特定主体且不能复原的前提下，掌金超平台有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</p>
        <p class="title">第四章 风险提示说明</p>
        <p class="item">第24条：</p>
        <p class="details">掌金超平台不对用户在掌金超平台上的交易及与合作机构进行的交易提供任何明示或默认的保证。由此产生的风险由用户自行承担。</p>
        <p class="item">第25条：</p>
        <p class="details">掌金超平台无法保证用户通过掌金超平台发布的信息的真实性、准确性和完整性，用户对其发布的信息承担全部责任。</p>
        <p class="title">第五章 服务费用说明</p>
        <p class="item">第26条：</p>
        <p class="details">用户使用掌金超平台通过掌金超平台提供的服务时，掌金超平台有权向用户收取相关费用。费用收取标准和规则详见用户与掌金超平台签署的相关具体协议的约定。</p>
        <p class="item">第27条：</p>
        <p class="details">用户在使用掌金超平台通过掌金超平台提供的服务时可能需要向其他主体支付一定的费用，具体收费标准和规则详见用户与掌金超平台或（及）其他主体签署的相关具体协议的约定，或掌金超平台公布的相应收费说明。</p>
        <p class="title">第六章 用户账户安全承诺</p>
        <p class="item">第28条：</p>
        <p style="text-indent:2em">用户账户是用户在掌金超平台的唯一标识。用户承诺妥善保管其注册手机号和微信号以及其他能够表示用户身份的信息，不将个人信息泄露给任何其他主体；否则，由此产生的损失，由用户自行承担。</p>
        <p class="item">第29条：</p>
        <p class="details">用户同意，确保账户安全是用户的责任。用户通过其在掌金超平台的账户所进行的一切操作，发布的一切言论，都视为用户的行为及其真实意图的表达，所有损失及法律后果由用户自行承担。</p>
        <p class="item">第30条：</p>
        <p class="details">
          为了对用户进行身份核验，保障用户登录安全，掌金超平台会记录用户使用设备的基础信息，包括国际移动设备标识、网络设备的物理地址、设备序列号、设备名称、设备品牌、设备机型、操作系统等。并且会记录用户地理位置信息、WIFI信息、基站信息等。这些信息将用于对用户唯一性的识别，防止恶意登录，保障用户账户安全。</p>
        <p class="item">第31条：</p>
        <p class="details">用户可随时登录其在掌金超平台的账号，查询并管理该账号下用户的信息。如用户遇到任何障碍或疑问，可联系掌金超平台客服。</p>
        <p class="title">第七章 用户守法承诺</p>
        <p class="item">第32条：</p>
        <p class="details">用户承诺不以任何非法目的或途径使用掌金超平台通过掌金超公众号提供的服务，并遵守相关法律、法规、政策、规范性文件及掌金超平台制定的各制度、规则的规定。因违背上述承诺造成的损失及后果，用户自行负全部责任。</p>
        <p class="item">第33条：</p>
        <p class="details">用户承诺严格按照本协议履行义务。如未完全履行义务，掌金超平台有权将其违约行为记入用户信用资料，并有权通过合法方式公布其违约行为。</p>
        <p class="title">第八章 掌金超服务中断说明</p>
        <p class="item">第34条：</p>
        <p class="details">基于互联网的特殊性，掌金超平台通过掌金超平台提供的服务存在中断的可能性，用户对次表示理解。由于系统维护、设备故障、黑客攻击及其他不可抗力的影响，而导致用户无法正常使用相关服务时，掌金超平台不承担任何责任。</p>
        <p class="title">第九章 责任范围说明</p>
        <p class="item">第35条：</p>
        <p class="details">掌金超平台是依法设立，专门从事网络借贷信息中介业务活动的金融信息中介公司。</p>
        <p class="item">第36条：</p>
        <p class="details">掌金超公众号是掌金超平台经营的提供网络借贷信息中介服务的的互联网平台。掌金超平台通过掌金超公众号为用户提供信息服务。</p>
        <p class="item">第37条：</p>
        <p class="details">掌金超平台合作机构提供的服务由该合作单位负责，掌金超平台不承担任何责任。</p>
        <p class="item">第38条：</p>
        <p class="details">用户从掌金超平台工作人员处取得的建议、说明，不构成掌金超平台对服务的承诺和保证；用户自行决策，由此产生的法律后果，由用户自行承担相应后果和责任。</p>
        <p class="item">第39条：</p>
        <p class="details">用户同意，掌金超平台可通过任何合法途径收集用户的额外信息，以更好地掌握用户的实际情况。</p>
        <p class="item">第40条：</p>
        <p class="details">为避免用户通过掌金超平台从事违法、违规或犯罪活动，保护掌金超平台及其他用户的合法权益，掌金超平台有权通过人工或自动程序对用户信息进行审核及评价。</p>
        <p class="item">第41条：</p>
        <p class="details">
          掌金超平台制定了严格的用户信息处理规则和采取必要技术措施保护用户的信息安全，确保用户信息不被滥用。除征得用户明确同意和法律法规另有规定或国家司法、行政机关、行业协会、相应监管机构要求，本平台不会向任何第三方提供或对外披露用户信息。</p>
        <p class="title">第十一章 知识产权保护说明</p>
        <p class="item">第42条：</p>
        <p class="details">
          掌金超平台上所有内容的知识产权均由掌金超平台及其权利人依法拥有，包括但不限于文本、数据、文章、图片、资讯、平台架构、网页设计等。未经掌金超平台或其权利人书面同意，任何人不得擅自使用、修改、复制、公开发布相关内容；如有违反，用户应对掌金超平台及其权利人承担损害赔偿等法律责任。</p>
        <p class="title">第十二章 法律适用说明</p>
        <p class="item">第43条：</p>
        <p class="details">本协议由用户与掌金超平台共同签订，适用于用户在掌金超平台的一切活动。掌金超平台通过掌金超平台已发布的或将来可能发布的各类规则，都应视为本协议不可分割的一部分，与协议正文条款享有同等法律效力。</p>
        <p class="item">第44条：</p>
        <p class="details">掌金超平台对本协议具有最终解释权。</p>
        <p class="item">第45条：</p>
        <p class="details">
          本协议签订地为中华人民共和国北京市。因本协议所引起的用户与掌金超平台的任何纠纷及争议，各方一致同意，不论争议金额大小，均提交北京仲裁委员会适用北京仲裁委员会仲裁规则项下的简易程序进行仲裁。仲裁裁决为终局裁决，对双方均具有约束力。</p>
      </div>
      <div class="btnBox">
        <button @click="closeModal">我已阅读完毕</button>
      </div>
    </div>
  </div>

</template>

<script>
  export default {
    props: ['closeModal'],
    name: "agreement-mod"
  }
</script>

<style lang='stylus' rel="stylesheet/stylus">
  .agreementMod
    position fixed
    top 0
    left 0
    width 100%
    height 100%
    background-color rgba(0, 0, 0, 0.3)
    .modal
      width (920 /$rem)
      height (1200 /$rem)
      border 1px solid #333
      position absolute
      top (238 /$rem)
      left 50%
      margin-left -(460 /$rem)
      border-radius (20 /$rem)
      background-color #fff

      .textContent
        height (994 /$rem)
        overflow auto
        font-size (40 /$rem)
        padding 0 (50 /$rem)
        p
          line-height (60 /$rem)
          &.special
            font-size (46 /$rem)
            text-align center
            margin-top (60 /$rem)
            margin-bottom (40 /$rem)
          &.details
            text-indent:2em
      .btnBox
        padding (30 /$rem) (50 /$rem)
        button
          width 100%
          background-color #efca7d
          height (146 /$rem)
          border-radius (20 /$rem)
          color #fff
          font-size (46 /$rem)
</style>
